Revit 2024 API
LightGroup.GetLights Method
 Get the set of contained light instances The set of light instances
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ICollection<ElementId> GetLights()
Visual Basic
Public Function GetLights As ICollection(Of ElementId)
Visual C++
public:
ICollection<ElementId^>^ GetLights()
See Also
LightGroup Class
Autodesk.Revit.DB.Lighting Namespace